
[
    {
      "title": "to do",
      "author": "Jane Doe",
      "date": "2024-06-01",
      "content": " da alvinee preview data veanm for all-posts page pinnne full content on separate one by one page"
    },
    {
      "title": "Our monkey brain and life",
      "author": "Aaron", 
      "date": "2024-04-20",
      "content": "Like Thor said to Loki- “life is about growth, it’s about change but you seem to just wanna stay the same I guess. what I’m trying to say is that you’ll always be the god of mischief but you could be more”\n\nIt hits different when you start to realize that Loki is not just the god of mischief, but also the god of the sacred timeline. He learned from his mistakes and changed, that's what life is. He sacrificed everything to save everyone in the timeline, maybe that was his purpose.\n\nAs a human, I truly believe that everyone has their own purpose and we just need to wait and find it.\n\nWe have to learn from our mistakes and improve, then only can we unleash our potential.\n\nIf you think about Life, it is pretty simple but you are just making it complicated in your head. The thing is your mind is not on your side, and every thought isn’t yours.\n\nOur Emotions are fleeting\n- but we can choose to dwell on them or let them go.\n\nWe have up to 80,000 thoughts a day, half of them may be negative.\n- we need to realize that our thoughts are just thoughts, not reality.\n- We can control our minds by acknowledging and challenging negative thoughts and focusing on positive thoughts.\n\nOur thoughts are powerful and can shape our emotions, behaviors, and well-being.\n\nThe key to eliminating mental suffering is mastering your thoughts, recognizing that you are not your thoughts but rather an observer of them, and choosing which thoughts to give power to.\n\nThere are two aspects within you: your higher self, which seeks your highest potential, and your lower self, which seeks comfort and instant gratification. These two selves are in a constant war, with thoughts as their soldiers.\n\nGiving attention to thoughts sent by the lower self empowers it, leading you towards a life of comfort-seeking and instant gratification, which is the opposite of change and success.\n\nTo win the war against the lower self, you must understand it fully and refuse to give attention to any thoughts it sends. It is vital to analyze your thoughts and the actions they lead to critically.\n\nI truly believe that a strong resilient mind is the first arc we have to build for a happy and purposeful life.\n\nEvolution isn’t just about physical changes — it’s a process encompassing fitness, knowledge, mindset, and other areas of life. To survive and thrive, we must continuously strive for improvement. Reflect on your strengths and weaknesses, setting a blueprint for evolving into your best self.\n\nWhat we need in our life is wisdom and knowledge and luckily we are surrounded by it, we just need to seek it out, whether through books, experiences, or interactions with others.\n\nChange and growth."
     }
    
  ]
 